src/toir_cfe/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/торо_РабочееМестоТехническогоСпециалиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="57985ced-0cfd-4a5a-a4b6-c9b1f1c12be2">
  <name>торо_РабочееМестоТехническогоСпециалиста</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/toir_cfe/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8fbeca-59ee-4207-b4da-c1fdb926cf07">
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ca7de41a-4380-42d3-b93b-3d14a13ce3d9">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a534769e-5beb-4b57-b3af-d138e38afe8e">
    <name>ЕстьЗаявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e320ae57-9da9-47dd-9d22-4265d1574beb">
    <name>ЕстьНаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26632482-bdd2-4881-af87-d856096d8d30">
    <name>ЕстьАкт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d55a38b3-ccd6-42d5-ae8f-6fe7a5e3b7e3">
    <name>ЕстьАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f7d027da-099e-47c1-b6c6-76397094ed0e">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="646d6d26-3edf-4e80-88ae-f94e1a83e51d">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="760d81bf-833c-42a4-8d1e-f2df012d64e5">
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ba85eb5c-9b6e-4b48-91c7-27de33dd2f16">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="088d9db2-1a15-4bff-99d4-26bc08da07cd">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8d7e3dc7-96eb-4e67-9634-d1e75420b4bb">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="60e67476-1608-4996-b48f-ffa74f993732">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="332898fd-fb46-4e34-af0e-1450d855fac1">
    <name>ПодразделениеИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="442326ff-0b99-4a6d-81af-fa819b4a7b89">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17a02a98-8e64-4576-9b3b-4cfc58e2d8cf">
  <name>торо_ИнтеграцияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="e9a88077-61c6-452d-90f2-47d4f24e77da">
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="4736aca1-8591-4fd1-81ac-2e197db4fc05">
    <name>ДокументТОИР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e9f3faae-f405-4f24-9277-030e531fcfbb">
    <name>ДокументЕРП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/AccumulationRegisters/ЗаказыНаВнутреннееПотребление/ЗаказыНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8e3cf62-a29a-4eb6-a0cd-e005b9df98cc">
  <name>ЗаказыНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="3b3e1e2b-83d4-4335-a03f-8801607a9128">
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="c4f0e75b-3aa7-4acb-9b3b-e7fc3b1c66e2">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="92ba211b-e615-40a8-aaf1-faae851399f1">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="581e19d8-10ab-490b-8ae2-4316b7e81b6c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="897933ed-4417-494e-a54b-4e8adf9b7794">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/торо_РезервыНаСкладах/торо_РезервыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="98b94913-15ed-4617-8385-ab2daba22f81">
  <name>торо_РезервыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="96806bd1-1388-482a-bf3b-489a7bb1618f">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="1b512fd8-7b48-4d08-93b9-cfb739198abd">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b5f04b06-dd61-4f1e-8ffb-697e21d86316">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e7b625fb-45af-423f-8960-59d2cd4c0f2e">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="323fac0c-b396-4203-b0a2-adf8ac42f936">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b00a4ae7-3813-4dbf-8c92-4d85cc0b5541">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bab26d2a-59a2-481b-b08d-32ff66a42026">
    <name>ДокументРезерв</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09bf821b-96d8-44ff-a873-1aa963572a34">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="72058171-1407-4dd6-aab0-0f72afd60d2a">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="168c85e9-3bb0-431a-ae6e-08c455b37fa5">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9f5d4e4f-bee5-4929-ac3d-e4200cf1416f">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6306ae3-4e8a-4225-8afa-a01e16f34954">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="85c92d14-1c04-44bd-9284-befe63c7394c">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="605b0bf5-59d2-473b-b6f9-85ceca4cd110">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Enums/торо_ВидыДокументовНачалаЦепочкиРемонтов/торо_ВидыДокументовНачалаЦепочкиРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9a4a271c-3df6-45ca-a18a-c3a215a23313">
  <name>торо_ВидыДокументовНачалаЦепочкиРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="567a12d3-c608-43f0-a336-d5f773d2a52a">
    <name>ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="71d3ac2c-00e7-4f96-8907-382131bb091a">
    <name>ВыявленныйДефект</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="567318ad-fa36-4a40-8027-655e8c8f1c0b">
    <name>ПланГрафикППР</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dddfb2af-bfea-4ecb-bce9-f89ad241fcdb">
    <name>ГрафикРегламентныхМероприятий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf35ff03-c641-42bf-90fc-6469235dafc0">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8b164589-2f76-44c2-86db-13b16b9df744">
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2cd062c3-ed73-4f60-acc5-8ad2b64fc56a">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/DataProcessors/торо_РабочееМестоТехническогоСпециалиста/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #218, Карпов.Д.Ю., 11.08.2023
	НоваяКоманда = Команды.Добавить("ОткрытьРабочееМестоСпециалистаПоОбеспечению"); 
	НоваяКоманда.Действие = "ОткрытьРабочееМестоСпециалистаПоОбеспечениюНажатие"; 
	НоваяКоманда.Заголовок = "Рабочее место специалиста по обеспечению";
	
	НовыйЭлемент = Элементы.Добавить("ОткрытьРабочееМестоСпециалистаПоОбеспечению", Тип("КнопкаФормы"), Элементы.Группа3);
	НовыйЭлемент.ИмяКоманды = "ОткрытьРабочееМестоСпециалистаПоОбеспечению"; 
	//++ Проф-ИТ, #218, Карпов.Д.Ю., 11.08.2023

	//++ Проф-ИТ, #322, Соловьев А.А., 31.10.2023
	СтруктураСвойствСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СтруктураСвойствСписка.ТекстЗапроса = ТекстЗапросаРемонты();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Ремонты, СтруктураСвойствСписка);
	//-- Проф-ИТ, #322, Соловьев А.А., 31.10.2023
	
	//++ Проф-ИТ, #329, Соловьев А.А., 08.11.2023
	НоваяКоманда = Команды.Добавить("проф_ОткрытьФормуСписаниеТМЦ"); 
	НоваяКоманда.Действие = "проф_ОткрытьФормуСписаниеТМЦ"; 
	НоваяКоманда.Заголовок = "Списать ТМЦ по закрытым ремонтам";
	НоваяКоманда.Картинка = БиблиотекаКартинок.БыстрыйДоступ;
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	НовыйЭлемент = Элементы.Добавить("проф_ОткрытьФормуСписаниеТМЦ", Тип("КнопкаФормы"), Элементы.Группа3);
	НовыйЭлемент.ИмяКоманды = "проф_ОткрытьФормуСписаниеТМЦ"; 
	//-- Проф-ИТ, #329, Соловьев А.А., 08.11.2023
	
	//++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	ДополнитьОтборы();
	
	НоваяКоманда = Команды.Добавить("проф_СвязанныеДокументыРемонта"); 
	НоваяКоманда.Действие = "проф_СвязанныеДокументыРемонта"; 
	НоваяКоманда.Заголовок = "Связанные документы";
	НоваяКоманда.Картинка = БиблиотекаКартинок.Отчеты;
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	НовыйЭлемент = Элементы.Добавить("проф_СвязанныеДокументыРемонта", Тип("КнопкаФормы"), Элементы.Группа3);
	НовыйЭлемент.ИмяКоманды = "проф_СвязанныеДокументыРемонта"; 
	//-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ОткрытьРабочееМестоСпециалистаПоОбеспечениюНажатие(Команда)
	//++ Проф-ИТ, #218, Карпов.Д.Ю., 11.08.2023	
	ОткрытьФорму("Обработка.торо_РабочееМестоСпециалистаОбеспечения.Форма.Форма"); 
	//++ Проф-ИТ, #218, Карпов.Д.Ю., 11.08.2023
КонецПроцедуры

//++ Проф-ИТ, #329, Соловьев А.А., 08.11.2023
&НаКлиенте
Процедура проф_ОткрытьФормуСписаниеТМЦ(Команда)
	ОткрытьФорму("Обработка.торо_РабочееМестоТехническогоСпециалиста.Форма.проф_ФормаСписаниеТМЦ"); 
КонецПроцедуры
//-- Проф-ИТ, #329, Соловьев А.А., 08.11.2023

//++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023
&НаКлиенте
Процедура проф_СвязанныеДокументыРемонта(Команда)
	
	ТекущиеДанные = Элементы.Ремонты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Документ", ТекущиеДанные.Документ);
	ОткрытьФорму("КритерийОтбора.торо_СвязанныеДокументыПоРемонту.ФормаСписка",
		ПараметрыФормы, ТекущиеДанные.Документ, , , );
	
КонецПроцедуры
//-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023

#КонецОбласти

#Область ОбработчикиКомандЭлементовШапкиФормы

//++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023

&НаКлиенте
Процедура ИспользоватьОтборПоГосНомеруПриИзменении(Элемент)
	УстановитьОтборПоГосНомеру();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоVINПриИзменении(Элемент)
	УстановитьОтборПоVIN();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоГосНомеруПриИзменении(Элемент)
	УстановитьОтборПоГосНомеру();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоVINПриИзменении(Элемент)
	УстановитьОтборПоVIN();
КонецПроцедуры

//-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьВводДокументаНаОсновании")
Процедура Проф_ВыполнитьВводДокументаНаОсновании(ТипВводимогоДокумента, ПредставлениеДокументаВВинПадеже)
	#Вставка
	//++ Проф-ИТ, #237, Карпов.Д.Ю., 11.08.2023
	Если ТипВводимогоДокумента = "торо_ЗаявкаНаРемонт" Тогда
		МассивОР = Новый Массив;
		Для Каждого НомСтроки Из Элементы.Ремонты.ВыделенныеСтроки Цикл
			Строка = Элементы.Ремонты.ДанныеСтроки(НомСтроки);
			Если МассивОР.Найти(Строка.ОбъектРемонта) = Неопределено Тогда
				МассивОР.Добавить(Строка.ОбъектРемонта);    			
			КонецЕсли;
		КонецЦикла;	
			
		Если МассивОР.Количество() > 1 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Документ должен быть создан по одному Объекту ремонта.");
			Возврат; 
	//++ Проф-ИТ, #250, Карпов.Д.Ю., 19.09.2023.Заменил директуву "Вместо" на "ИзменениеИКонтроль"
		КонецЕсли;
	//-- Проф-ИТ, #250, Карпов.Д.Ю., 19.09.2023
	КонецЕсли;
	//++ Проф-ИТ, #237, Карпов.Д.Ю., 11.08.2023
	#КонецВставки
		
	Если ТипВводимогоДокумента = "торо_НарядНаРегламентноеМероприятие"
		ИЛИ ТипВводимогоДокумента = "торо_АктОВыполненииРегламентногоМероприятия" Тогда
		ЭлементФормыТаблица = Элементы.Мероприятия;
	Иначе
		ЭлементФормыТаблица = Элементы.Ремонты;
	КонецЕсли;
	#Удаление
	МассивДанныхСтрок = Новый Массив;
	Если НЕ ОбязательныеПроверкиПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок) Тогда
		Возврат;
	КонецЕсли;
	#КонецУдаления
	#Вставка  
	//++ Проф-ИТ, #250, Карпов.Д.Ю., 19.09.2023
	ТекДанные = ЭлементФормыТаблица.ТекущиеДанные;
	МассивДанныхСтрок = Новый Массив;
	Если ТипВводимогоДокумента = "торо_НарядНаВыполнениеРемонтныхРабот" Тогда
		Если НЕ проф_ОбязательныеПроверкиПередВводомНаОсновании(МассивДанныхСтрок, "заявку на ") Тогда
			Возврат;
		КонецЕсли;
	//++ Проф-ИТ, #300, Корнилов М.С., 16.10.2023
	ИначеЕсли ТипВводимогоДокумента = "торо_ЗаявкаНаРемонт" 
		И ТипЗнч(ТекДанные.Документ) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		
		Если НЕ ОбязательныеПроверкиЗаявкаНаРемонтПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок) Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли ТипВводимогоДокумента = "торо_АктОВыполненииЭтапаРабот" Тогда 	
		Если НЕ проф_ОбязательныеПроверкиПередВводомНаОсновании(МассивДанныхСтрок) Тогда
			Возврат;
		КонецЕсли;
	//-- Проф-ИТ, #300, Корнилов М.С., 16.10.2023
	Иначе
		Если НЕ ОбязательныеПроверкиПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-- Проф-ИТ, #250, Карпов.Д.Ю., 19.09.2023.
	#КонецВставки
	ЗаполнитьТаблицуВводаНаОсновании();
	
	МассивРемонтовППР = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта")
			ИЛИ ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
			МассивРемонтовППР.Добавить(Строка.ID_Ремонта);
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеКорректировокППР = Новый Соответствие;
	Если МассивРемонтовППР.Количество() > 0 Тогда
		ЗаполнитьСоответствиеКорректировокППР(МассивРемонтовППР, СоответствиеКорректировокППР);
	КонецЕсли;
	
	СоответствиеРемонтовИОснований = Новый Соответствие;
		
	// Добавление возможных оснований.
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ПроверитьВводНаОсновании(Строка.ТипДокумента, ТипВводимогоДокумента) Тогда
			КорректировкаППР = СоответствиеКорректировокППР.Получить(Строка.ID_Ремонта);
			Если КорректировкаППР = Неопределено Тогда
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, Строка.Документ);
			Иначе
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, КорректировкаППР);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	// Добавляетя выявленные дефекты, введенные на основании ВО. 
	// С релиза 2.0.38.1 связь больше не сохраняется. 
	// Сохранено для временного поддержания обратной совместимости со старыми документами.
	Если ПроверитьВводНаОсновании("торо_ВыявленныеДефекты", ТипВводимогоДокумента) И ФОИспользоватьДефекты Тогда
		
		ТаблицаЗаявок = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "ВыявленныеДефекты", Истина);
		Для каждого Строка из ТаблицаЗаявок Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроверитьВводНаОсновании("торо_ЗаявкаНаРемонт", ТипВводимогоДокумента) И ФОИспользоватьСметы Тогда
		
		ТаблицаЗаявок = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "ЗаявкиНаРемонт", Истина);
		Для каждого Строка из ТаблицаЗаявок Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроверитьВводНаОсновании("торо_НарядНаВыполнениеРемонтныхРабот", ТипВводимогоДокумента) И ФОИспользоватьНаряды Тогда
		
		ТаблицаНарядов = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "НарядыНаРемонт", Истина);
		Для каждого Строка из ТаблицаНарядов Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроверитьВводНаОсновании("торо_НарядНаРегламентноеМероприятие", ТипВводимогоДокумента) И ФОИспользоватьНарядыНаРегламентныеМероприятия Тогда
		
		ТаблицаНарядов = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "НарядыНаМероприятия", Истина);
		Для каждого Строка из ТаблицаНарядов Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаВВинПадеже) Тогда
		Возврат;
	КонецЕсли;

	Если СоответствиеРемонтовИОснований.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, нужно ли открывать форму выбора основания.
	ОткрыватьФормуВыбораОснования = Ложь;
	Для каждого КлючИЗначение из СоответствиеРемонтовИОснований Цикл
		Если КлючИЗначение.Значение.Количество() > 1 Тогда
			ОткрыватьФормуВыбораОснования = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОткрыватьФормуВыбораОснования Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыборОснованийДляДокумента",ЭтаФорма,Новый Структура("СоздаваемыйДокумент", ТипВводимогоДокумента));
		
		СтруктураДанныхДляВыбораОснований = Новый Структура;
		СтруктураДанныхДляВыбораОснований.Вставить("СоответствиеРемонтовИОснований" , СоответствиеРемонтовИОснований);
		СтруктураДанныхДляВыбораОснований.Вставить("МассивВыделенныхСтрок" , МассивДанныхСтрок);
		
		ОткрытьФорму("Обработка.торо_РабочееМестоТехническогоСпециалиста.Форма.ФормаВыбораОснования",СтруктураДанныхДляВыбораОснований,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка."+ТипВводимогоДокумента)));
		
		СоответствиеИДДокументам = Новый Соответствие;
		Для каждого КлючИЗначение Из СоответствиеРемонтовИОснований Цикл
			Если КлючИЗначение.Значение.Количество() > 0 Тогда
				СоответствиеИДДокументам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение[0]);
			КонецЕсли;
		КонецЦикла; 
		
		СоздатьДокументИОткрытьФорму("Документ."+ТипВводимогоДокумента+".ФормаОбъекта", СоответствиеИДДокументам, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция проф_ОбязательныеПроверкиПередВводомНаОсновании(МассивДанныхСтрок, Текст = "")
	//++ Проф-ИТ, #250, Карпов.Д.Ю., 20.09.2023
	ТекДанные = Элементы.ЗаявкиНаРемонт.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Выберите %1ремонт!'"), Текст);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	МассивДокументов = ПолучитьМассивВыделенныхДокументов(Элементы.ЗаявкиНаРемонт,"ДокументЗаявка");
	МассивВыделенныхСтрок = ПолучитьМассивСтрокРемонтовПоДокументу(МассивДокументов);
	
	ОбработатьОстановочныеРемонтыИЗакрытия(МассивВыделенныхСтрок);
	
	КолЗавершенных = 0;
	
	Для Каждого Строка Из МассивВыделенныхСтрок Цикл
		
		Если ЗначениеЗаполнено(Строка.Завершенные) Тогда
			Если ТипЗнч(Строка.Завершенные) = Тип("Строка")
			Или Строка.Завершенные  Тогда
				КолЗавершенных = КолЗавершенных + 1;
			Иначе
				Структура = Новый Структура;
				Структура.Вставить("ОбъектРемонта", Строка.ОбъектРемонта);
				Структура.Вставить("ВидРемонта", Строка.ВидРемонта);
				Структура.Вставить("ПланируемаяДатаНачалаРемонта", Строка.ПланируемаяДатаНачалаРемонта);
				Структура.Вставить("ID_Ремонта", Строка.ID_Ремонта);
				Структура.Вставить("Документ", Строка.Документ);
				Структура.Вставить("ТипДокумента", Строка.ТипДокумента);

				МассивДанныхСтрок.Добавить(Структура);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КолЗавершенных > 0 Тогда
		ТекстСообщения = НСтр("ru = 'В списке выбранных ремонтов есть завершенные!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	//-- Проф-ИТ, #250, Карпов.Д.Ю., 20.09.2023 
КонецФункции 

&НаКлиенте
Функция ПолучитьМассивВыделенныхДокументов(ЭлементФормыТаблица,РеквизитДокумента) 
	
	//++ Проф-ИТ, #250, Карпов.Д.Ю., 20.09.2023 	
	МассивДокументовЗаявкаНаРемонт = Новый Массив;
	Для Каждого НомСтроки Из ЭлементФормыТаблица.ВыделенныеСтроки Цикл
		Строка = ЭлементФормыТаблица.ДанныеСтроки(НомСтроки);
		Если Строка <> Неопределено Тогда 
			МассивДокументовЗаявкаНаРемонт.Добавить(Строка[РеквизитДокумента]);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивДокументовЗаявкаНаРемонт;
	//-- Проф-ИТ, #250, Карпов.Д.Ю., 20.09.2023 
	
КонецФункции

&НаСервере
Функция ПолучитьМассивСтрокРемонтовПоДокументу(Знач МассивДокументовЗаявкаНаРемонт) 
	
	//++ Проф-ИТ, #250, Карпов.Д.Ю., 20.09.2023 		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ПланируемаяДатаНачалаРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID_Ремонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник КАК Документ,
		|	ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник) КАК ТипДокумента
		|ПОМЕСТИТЬ ВТ_ДанныеПоЗаявкам
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&СсылкаДокумент)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПоЗаявкам.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ДанныеПоЗаявкам.ВидРемонта КАК ВидРемонта,
		|	ВТ_ДанныеПоЗаявкам.ПланируемаяДатаНачалаРемонта КАК ПланируемаяДатаНачалаРемонта,
		|	ВТ_ДанныеПоЗаявкам.ID_Ремонта КАК ID_Ремонта,
		|	ВТ_ДанныеПоЗаявкам.Документ КАК Документ,
		|	ВТ_ДанныеПоЗаявкам.ТипДокумента КАК ТипДокумента,
		|	ЕСТЬNULL(торо_ОбщиеДанныеПоРемонтам.Завершен, ЛОЖЬ) КАК Завершенные
		|ИЗ
		|	ВТ_ДанныеПоЗаявкам КАК ВТ_ДанныеПоЗаявкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
		|		ПО ВТ_ДанныеПоЗаявкам.ID_Ремонта = торо_ОбщиеДанныеПоРемонтам.IDРемонта";
	
	Запрос.УстановитьПараметр("СсылкаДокумент", МассивДокументовЗаявкаНаРемонт);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Выгрузить());
	//-- Проф-ИТ, #250, Карпов.Д.Ю., 20.09.2023 
	
КонецФункции

//++ Проф-ИТ, #300, Корнилов М.С., 16.10.2023
&НаКлиенте
Функция ОбязательныеПроверкиЗаявкаНаРемонтПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок) 

	ТекДанные = ЭлементФормыТаблица.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Выберите ремонт!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	МассивРемонтов = ПолучитьМассивРемонтовПоВыявленномуДефекту(ТекДанные.Документ);
	
	ОбработатьОстановочныеРемонтыИЗакрытия(МассивРемонтов);
	
	КолЗавершенных = 0;
	
	Для Каждого Строка Из МассивРемонтов Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Завершенные) Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ТипЗнч(Строка.Завершенные) = Тип("Строка")
		Или Строка.Завершенные Тогда
			КолЗавершенных = КолЗавершенных + 1;
		Иначе                                   
			Структура = Новый Структура("ОбъектРемонта, ВидРемонта, ПланируемаяДатаНачалаРемонта,
										|ID_Ремонта, Документ, ТипДокумента");
			ЗаполнитьЗначенияСвойств(Структура, Строка);
			МассивДанныхСтрок.Добавить(Структура);
		КонецЕсли;		
		
	КонецЦикла;
	
	Если КолЗавершенных > 0 Тогда
		ТекстСообщения = НСтр("ru = 'В списке выбранных ремонтов есть завершенные!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивРемонтовПоВыявленномуДефекту(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
	|	ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка) КАК ВидРемонта,
	|	торо_ВыявленныеДефекты.ДатаОбнаружения КАК ПланируемаяДатаНачалаРемонта,
	|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID_Ремонта,
	|	торо_ВыявленныеДефекты.Ссылка КАК Документ,
	|	ТИПЗНАЧЕНИЯ(торо_ВыявленныеДефекты.Ссылка) КАК ТипДокумента
	|ПОМЕСТИТЬ ВТ_ДанныеПоЗаявкам
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ВыявленныеДефекты.Ссылка
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка = &ДокументСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЗаявкам.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ДанныеПоЗаявкам.ВидРемонта КАК ВидРемонта,
	|	ВТ_ДанныеПоЗаявкам.ПланируемаяДатаНачалаРемонта КАК ПланируемаяДатаНачалаРемонта,
	|	ВТ_ДанныеПоЗаявкам.ID_Ремонта КАК ID_Ремонта,
	|	ВТ_ДанныеПоЗаявкам.Документ КАК Документ,
	|	ВТ_ДанныеПоЗаявкам.ТипДокумента КАК ТипДокумента,
	|	ЕСТЬNULL(торо_ОбщиеДанныеПоРемонтам.Завершен, ЛОЖЬ) КАК Завершенные
	|ИЗ
	|	ВТ_ДанныеПоЗаявкам КАК ВТ_ДанныеПоЗаявкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ПО ВТ_ДанныеПоЗаявкам.ID_Ремонта = торо_ОбщиеДанныеПоРемонтам.IDРемонта";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Выгрузить());
	
КонецФункции
//-- Проф-ИТ, #300, Корнилов М.С., 16.10.2023

//++ Проф-ИТ, #322, Соловьев А.А., 31.10.2023
&НаСервере
Функция ТекстЗапросаРемонты()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнтеграцияДокументов.ID КАК ID,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗаказыОстатки.КОформлениюОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0) - ЕСТЬNULL(НаРуках.КоличествоОстаток, 0) <= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Обеспечен
	|ПОМЕСТИТЬ Обеспечение
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК ИнтеграцияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки КАК ЗаказыОстатки
	|		ПО (ТИПЗНАЧЕНИЯ(ИнтеграцияДокументов.ДокументЕРП) = ТИП(Документ.ЗаказНаВнутреннееПотребление))
	|			И ИнтеграцияДокументов.ДокументЕРП = ЗаказыОстатки.ЗаказНаВнутреннееПотребление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_РезервыНаСкладах.Остатки КАК Резервы
	|		ПО (ЗаказыОстатки.ЗаказНаВнутреннееПотребление = Резервы.ЗаказНаВнутреннееПотребление)
	|			И (ЗаказыОстатки.Номенклатура = Резервы.Номенклатура)
	|			И (ЗаказыОстатки.Характеристика = Резервы.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ТоварыНаРуках.Остатки КАК НаРуках
	|		ПО (ЗаказыОстатки.ЗаказНаВнутреннееПотребление = НаРуках.ЗаказНаВнутреннееПотребление)
	|			И (ЗаказыОстатки.Номенклатура = НаРуках.Номенклатура)
	|			И (ЗаказыОстатки.Характеристика = НаРуках.Характеристика)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнтеграцияДокументов.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбщиеДанныеПоРемонтам.IDРемонта КАК ID_Ремонта,
	|	торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки КАК ТипДокумента,
	|	торо_ОбщиеДанныеПоРемонтам.ДокументНачалаЦепочки КАК Документ,
	|	ВЫРАЗИТЬ(торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОбъектРемонта,
	|	торо_ОбъектыРемонта.Приоритет КАК ПриоритетОР,
	|	ВЫБОР
	|		КОГДА торо_ОбщиеДанныеПоРемонтам.ВидРемонта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
	|				И торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВыявленныйДефект)
	|			ТОГДА &торо_ВидРемонтаВД
	|		КОГДА торо_ОбщиеДанныеПоРемонтам.ВидРемонта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
	|				И торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВнешнееОснованиеДляРабот)
	|			ТОГДА &торо_ВидРемонтаВО
	|		ИНАЧЕ торо_ОбщиеДанныеПоРемонтам.ВидРемонта
	|	КОНЕЦ КАК ВидРемонта,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК ДокументПлановыхДат,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ПланируемаяДатаНачалаРемонта,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ПланируемаяДатаОкончанияРемонта,
	|	ЕСТЬNULL(торо_ПлановыеИсполнителиРемонтов.СпособВыполнения, НЕОПРЕДЕЛЕНО) КАК СпособВыполнения,
	|	ЕСТЬNULL(торо_ПлановыеИсполнителиРемонтов.Исполнитель, НЕОПРЕДЕЛЕНО) КАК Исполнитель,
	|	ЕСТЬNULL(торо_ПлановыеИсполнителиРемонтов.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО) КАК Бригада,
	|	торо_ОбщиеДанныеПоРемонтам.Организация КАК Организация,
	|	торо_ОбщиеДанныеПоРемонтам.ПодразделениеИнициатор КАК Подразделение,
	|	торо_ОбщиеДанныеПоРемонтам.ЕстьЗаявка КАК ВведенаЗаявка,
	|	ВЫБОР
	|		КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|			ТОГДА ""Не установлено""
	|		ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|	КОНЕЦ КАК СостояниеОР,
	|	торо_ОбщиеДанныеПоРемонтам.Завершен КАК Завершенные,
	|	СтатусыРемонтов.Статус КАК СтатусРемонта,
	|	торо_ГарантийностьРемонтов.Гарантийный КАК ГарантийныйРемонт,
	|	ЕСТЬNULL(Обеспечение.Обеспечен, ЛОЖЬ) КАК Обеспечен,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного КАК IDОсновного,
	|	торо_ВыявленныеДефекты.ДефектОписание КАК ОписаниеДефекта,
	//++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|	торо_ОбъектыРемонта.проф_VIN КАК VIN,
	|	торо_ОбъектыРемонта.проф_Госномер КАК Госномер,
	//-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|	торо_ВыявленныеДефекты.КритичностьДефекта КАК КритичностьДефекта
	|ИЗ
	|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|			И (торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки В (&СписокВидовИсточников))
	|			И (торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала <= &ПлановыйПериод)
	|			И (НЕ торо_ОбщиеДанныеПоРемонтам.Отменен)
	|			И (торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала > &ДатаОтбораСнизу)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеИсполнителиРемонтов КАК торо_ПлановыеИсполнителиРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_ПлановыеИсполнителиРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ) КАК торо_ТекущееСостояниеОРСрезПоследних
	|		ПО торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта = торо_ТекущееСостояниеОРСрезПоследних.ОбъектРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обеспечение КАК Обеспечение
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = Обеспечение.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних КАК торо_ОстановочныеРемонтыСрезПоследних
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого
	|			И (НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_ВыявленныеДефекты.ID
	|			И торо_ОбщиеДанныеПоРемонтам.ДокументНачалаЦепочки = торо_ВыявленныеДефекты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыРемонтов.СрезПоследних КАК СтатусыРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = СтатусыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ГарантийностьРемонтов.СрезПоследних КАК торо_ГарантийностьРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_ГарантийностьРемонтов.IDРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|ГДЕ
	|	(&ОтображатьЗаверешенные = ИСТИНА
	|			ИЛИ торо_ОбщиеДанныеПоРемонтам.Завершен = ЛОЖЬ)
	|	И торо_ОбщиеДанныеПоРемонтам.Замещен = ЛОЖЬ
	|	И торо_ОбщиеДанныеПоРемонтам.ДокументНачалаЦепочки.ПометкаУдаления = ЛОЖЬ
	|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование.ПометкаУдаления = ЛОЖЬ";
	
	Возврат ТекстЗапроса;
	
КонецФункции
//-- Проф-ИТ, #322, Соловьев А.А., 31.10.2023

//++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023

&НаСервере
Процедура ДополнитьОтборы()
	
	ТипДанныхБулево = Новый ОписаниеТипов("Булево");
	ТипДанныхСтрока20 = Новый ОписаниеТипов("Строка", , 
		Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная));
	ТипДанныхСтрока12 = Новый ОписаниеТипов("Строка", , 
		Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная));
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("ИспользоватьОтборПоГосНомеру", ТипДанныхБулево); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("ОтборПоГосНомеру", ТипДанныхСтрока12); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("ИспользоватьОтборПоVIN", ТипДанныхБулево); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("ОтборПоVIN", ТипДанныхСтрока20); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	проф_ГруппаОтбор						= Элементы.Добавить("проф_ГруппаОтбор", Тип("ГруппаФормы"), Элементы.Группа6);
	проф_ГруппаОтбор.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
	проф_ГруппаОтбор.Отображение			= ОтображениеОбычнойГруппы.Нет;
	проф_ГруппаОтбор.ОтображатьЗаголовок	= Ложь; 
	проф_ГруппаОтбор.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент					= Элементы.Добавить("ИспользоватьОтборПоГосНомеру", Тип("ПолеФормы"), проф_ГруппаОтбор);
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок			= НСтр("ru = 'Использовать отбор по гос. номеру'");
	НовыйЭлемент.ПутьКДанным		= "ИспользоватьОтборПоГосНомеру";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ИспользоватьОтборПоГосНомеруПриИзменении");
	
	НовыйЭлемент  					= Элементы.Добавить("ОтборПоГосНомеру", Тип("ПолеФормы"), проф_ГруппаОтбор);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным		= "ОтборПоГосНомеру";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ОтборПоГосНомеруПриИзменении");
	
	НовыйЭлемент  					= Элементы.Добавить("ИспользоватьОтборПоVIN", Тип("ПолеФормы"), проф_ГруппаОтбор);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок			= НСтр("ru = 'Использовать отбор VIN'");
	НовыйЭлемент.ПутьКДанным		= "ИспользоватьОтборПоVIN";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ИспользоватьОтборПоVINПриИзменении");
	
	НовыйЭлемент					= Элементы.Добавить("ОтборПоVIN", Тип("ПолеФормы"), проф_ГруппаОтбор);
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным		= "ОтборПоVIN";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ОтборПоVINПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоГосНомеру()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ГосНомер", ЭтотОбъект["ОтборПоГосНомеру"], 
		ВидСравненияКомпоновкиДанных.Содержит, , ЭтотОбъект["ИспользоватьОтборПоГосНомеру"] И Не ПустаяСтрока(ЭтотОбъект["ОтборПоГосНомеру"]), 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоVIN()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "VIN", ЭтотОбъект["ОтборПоVIN"], 
		ВидСравненияКомпоновкиДанных.Содержит, , ЭтотОбъект["ИспользоватьОтборПоVIN"] И Не ПустаяСтрока(ЭтотОбъект["ОтборПоVIN"]), 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры
	
//-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023

#КонецОбласти
